[
{"profile_names": "Jessica", "ratings": "Very Surprised", "rating_icons": "5,0 von 5 Sternen", "review_texts": "I'm not one to leave reviews, but this headset has exceeded expectations in every way. I just needed a new pair and didn't want to spend much money. I had zero expectation for noise cancellation, but can say that I'm using these for work and my co-workers can not hear any background noise while I'm using them, at all. Noises that have me on edge during a meeting (children, noise in the other room, dogs) go completely unnoticed by co-workers. I've asked... they don't hear it all.", "review_states": "Verifizierter Kauf"},
{"profile_names": "Arjun Khandelwal", "ratings": "So worth it for the price!", "rating_icons": "4,0 von 5 Sternen", "review_texts": "I've had this for almost a year now. There were some problems with the extension wire when I first got it, so I had to replace that. Besides that, these are really good headphones with good audio quality for it's price. I use them for gaming and music and they're more than sufficient, everything works well.", "review_states": "Verifizierter Kauf"},
{"profile_names": "Senrats", "ratings": "Worth the price", "rating_icons": "4,0 von 5 Sternen", "review_texts": "Good headphones for the price, but they’re not great. A little clunky and you need to plug them into the USB port for them to light up. Again, worth the cheap price.", "review_states": "Verifizierter Kauf"},
{"profile_names": "Ozietwin", "ratings": "Great headphones for the price", "rating_icons": "5,0 von 5 Sternen", "review_texts": "I was looking for headphones for working at home.  These were priced right and work perfectly.  They are comfortable and lightweight. The noise cancellation is good and the sound quality is very good.  I have tried it on my playstation and it works perfectly.", "review_states": "Verifizierter Kauf"},
{"profile_names": "ken", "ratings": "Using it for MS Teams", "rating_icons": "5,0 von 5 Sternen", "review_texts": "I bought this because I needed a cheap setup for work, that if someone steals I won’t cry. The audio is clear, and I have 0 complaints from others about my audio. They are comfortable. I have a fat head (7-5/8” hat size) and they pinch a hair below my ears but not to where I can’t wear them for a 2 hour long meeting. The cord is long enough where I can reach anywhere in my cubicle without the cord going tight. NOT noise cancelling. (Didn’t expect it to be for the price)", "review_states": "Verifizierter Kauf"},
{"profile_names": "Michael Buteau", "ratings": "Bought for the kid", "rating_icons": "4,0 von 5 Sternen", "review_texts": "He loves them and he doesn't always take the best care of things so they seem to hold up", "review_states": "Verifizierter Kauf"},
{"profile_names": "Melissa", "ratings": "5 Stars for product support", "rating_icons": "5,0 von 5 Sternen", "review_texts": "I purchased these headphones for my husband on Sept. 2. The headset gave me peace to read my book while not having to listen to him or his teammates scream nonsense at each other.  He said they worked great with the noise canceling for when I am watching TikTok videos, that his game sounded good and he can hear other players' footsteps really well, and that the mic worked well enough no one complained about an echo. On Sunday, Sept 24 one side of the headset stopped working. He could hear some sounds but not everything or his teammates talking.  The following Monday, I emailed BENGOO and reported what happened. About two or three hours later, I received an email back asking to confirm my mailing address, and 10 to 15 mintures after that, I got an update saying a new pair was in the mail to be delivered on Thursday.  I give them 5 stars because customer support was easy and fast. I am hoping that the new set last longer than the first set we received.", "review_states": "Verifizierter Kauf"},
{"profile_names": "Mariah", "ratings": "Gaming headphones", "rating_icons": "5,0 von 5 Sternen", "review_texts": "These headphones are really good quality, The mic has an adjustment for the volume and it goes really loud if you would like it too I would really recommend buying these if you are a gamer or have a gaming station:)", "review_states": "Verifizierter Kauf"},
{"profile_names": "Kim S.", "ratings": "To actually plug in to my desk top jack and work.", "rating_icons": "4,0 von 5 Sternen", "review_texts": "This product probably works fine but I couldn't use it on my desk top. I guess it was incompatible on my device.", "review_states": "Verifizierter Kauf"},
{"profile_names": "Marella hammonds", "ratings": "Best value", "rating_icons": "5,0 von 5 Sternen", "review_texts": "I have gone through plenty of headsets over the years spending over a hundred dollars or more on headphones., and my no Bulls**t take on the Bengoo G9000 after almost a year of use is that I'll waste no more money on any (off the shelf) budget brands sold at Walmart ever again as the G9000's offer a greater above average price and quality ratio compared to other overpriced budget brands on the market. I'm not going to tell you that the G9000's have amazing sound quality compared to the hyper cloud X' phones I once had, nor is the microphone anything to rave about, but I will say that price and quality offered will bring me back every time before I'll go back into a local Walmart and pay the prices of other budget brands that have often not even lasted beyond the return policy.", "review_states": "Verifizierter Kauf"}
]