[
{"profile_names": "Gerloude Ulysse Paul", "ratings": "hope it helps", "rating_icons": "4,0 von 5 Sternen", "review_texts": "its a really good headset for gaming music and etc after a year the right part of the headset stoped working then after the whole headset stoped working i like it its a good price but i would not buy it again.", "review_states": "Verifizierter Kauf"},
{"profile_names": "JDowell", "ratings": "These are great for work & not just gaming!", "rating_icons": "5,0 von 5 Sternen", "review_texts": "I just received these & have only tried them out on abt 3 calls so far but everything was great. I work from home taking to go orders for restaurants & so I need to be able to hear the customers as well as them being able to hear me. I get a lot of calls from ppl in their cars who have me on speaker or Bluetooth & sometimes it’s hard to hear them over road noise & my last headset wasn’t cutting it anymore. I had it turned up all the way & it was still hard to hear them. Our calls are also recorded & graded by a computer & by ppl who pull random calls & grade them. I’m scoring 95% & higher (mostly 100’s) when the humans grade my calls but my score with the computer is at a 74% & I can’t figure out why. I’m hoping changing my headset will correct that. Maybe I will sound more clear. These sound very clear on the calls  & when I did a test call with them & recorded myself talking & then played it back. I didn’t necessarily need the lights but we meet on camera for meetings monthly & I thought they’d be cool! Lol I have the lil box with extra USB plug ins (see pic) & then u can just click the lil square button & it’ll turn it on & off so that’s where I plugged in the USB for the lights. That way I can just click the lil button when I want to turn them on. One other thing, I was used to my other microphone being a lot closer to my mouth bc it kind of bent around towards my mouth so I wasn’t sure how this one would pick up sound but it had no problems. The ear things go over my ears as well so ur ears won’t get sore. As u can see, I have room to slide my glasses in there with no discomfort & these aren’t heavy at all. I’d say they’re big head friendly bc I have them on as small as they’d go. They weren’t stretched out any here. I almost wish they went a tad smaller but it’s not a big issue. If ur buying for a kid & their head is smaller than mine then these wouldn’t work. If ur looking for a headset for actually working & not gaming, I’d recommend these!", "review_states": "Verifizierter Kauf"},
{"profile_names": "Amal Kharoufi", "ratings": "Affordable & Great Quality", "rating_icons": "4,0 von 5 Sternen", "review_texts": "I only just bought them but from what I seen so far they’re perfect for gaming/office work. They’re comfy and the mic has this bendy rubber thing going around on which I found weird but aside from that I don’t have any complaints. Definitely worth the money so don’t break ur pockets tryin to buy some overpriced headset.", "review_states": "Verifizierter Kauf"},
{"profile_names": "iansa.mf", "ratings": "I use it for work!", "rating_icons": "5,0 von 5 Sternen", "review_texts": "The new virtual world requires nice headsets... this are it! Every once in a while I think they look a bit flashy (I am a professor, supposed to look serious...lol) but they work great!", "review_states": "Verifizierter Kauf"},
{"profile_names": "Amazon Customer", "ratings": "Auricular", "rating_icons": "5,0 von 5 Sternen", "review_texts": "Me gustó el producto", "review_states": "Verifizierter Kauf"},
{"profile_names": "angelic green", "ratings": "Really long cord", "rating_icons": "3,0 von 5 Sternen", "review_texts": "Cord too long, picks up background sounds but it's do'able if need a headset temporarily", "review_states": "Verifizierter Kauf"},
{"profile_names": "Sandra", "ratings": "Great sound for value", "rating_icons": "5,0 von 5 Sternen", "review_texts": "These headphones rock! I sent back a pricier pair after owning these (my kid broke them) and bought this pair again.", "review_states": "Verifizierter Kauf"},
{"profile_names": "Maini kantako", "ratings": "Nice headphones", "rating_icons": "5,0 von 5 Sternen", "review_texts": "works well and lights up", "review_states": "Verifizierter Kauf"},
{"profile_names": "Maya  Weaver", "ratings": "Quality Control Issue?", "rating_icons": "3,0 von 5 Sternen", "review_texts": "I’ve purchased these headphones twice. The first time there was some mailing issues but I finally received them and they worked great until somehow the Jack got bent. I ordered some more, figuring that they bent headphone Jack was my fault, however the new pair arrived with a shortage in them. So maybe the Jack on the original pair were already bent? I’m not sure. But now I have two pairs of headphones that have sound/mic problems which honestly defeats the purpose of using them. I could just depend on the microphone on the controller.", "review_states": "Verifizierter Kauf"},
{"profile_names": "SHEILA RIVERA", "ratings": "PERFECT headphones for gaming, listening to music, etc.", "rating_icons": "5,0 von 5 Sternen", "review_texts": "Purchased these for my 6-year-old to game and he loves them!  Light up beautifully, and they are loud. I recommend.", "review_states": "Verifizierter Kauf"}
]